Tekla Open API Reference for Tekla Structures 2025
ModifiedObjectInfo.IsAttributeChanged Field
 Whether the object attribute (UDA) has changed.
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public readonly bool IsAttributeChanged
Public ReadOnly IsAttributeChanged As Boolean
Field Value
Type: Boolean
true if the object attribute has changed; otherwise, false.
See Also
Reference
ModifiedObjectInfo Structure
Tekla.Structures.Model.History Namespace